tutorials/CFD/17YJunction/0/Ulift1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.502568 0.33181 0)
(0.482043 0.195084 -5.25071e-21)
(0.370307 0.276895 2.84638e-21)
(0.504847 0.281189 0)
(0.391144 0.290271 4.92487e-21)
(0.441816 0.190352 0)
(0.523944 0.298466 -1.70478e-21)
(0.445359 0.18921 -3.17739e-21)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (1 1 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
