tutorials/CFD/17YJunction/0/Uliftx0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftx0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.416974 0 0)
(0.534499 0 0)
(0.410603 0 0)
(0.439099 0 0)
(0.382324 0 0)
(0.496798 0 0)
(0.453315 0 0)
(0.523582 0 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0.56195 0 0)
(0.612482 0 0)
(0.64269 0 0)
(0.663142 0 0)
(0.678054 0 0)
(0.689338 0 0)
(0.697968 0 0)
(0.704491 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
