tutorials/CFD/17YJunction/0/Ulifty1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulifty1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0 0.33181 0)
(0 0.195084 0)
(0 0.276895 0)
(0 0.281189 0)
(0 0.290271 0)
(0 0.190352 0)
(0 0.298466 0)
(0 0.18921 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (0 1 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0 -0.0287197 0)
(0 -0.0631127 0)
(0 -0.0685057 0)
(0 -0.066088 0)
(0 -0.0610863 0)
(0 -0.0550171 0)
(0 -0.0484457 0)
(0 -0.0416717 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
